Revit 2027 API
LinkLoadResult.IsNested Property
 True if these results represent a nested link; false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsNested { get; }
Public ReadOnly Property IsNested As Boolean
	Get
public:
property bool IsNested {
	bool get ();
}
member IsNested : bool with get
Property Value
Boolean
Remarks
 This property is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace